[Killed] String mutation
lab-2025-i-si784-u2-05-cs-nkmelndz/Bank/Bank.Domain/BankAccount.cs:22:55
             if (amount > m_balance)
                 throw new ArgumentOutOfRangeException("amount", amount, DebitAmountExceedsBalanceMessage);
             if (amount < 0)
-                throw new ArgumentOutOfRangeException("amount", amount, DebitAmountLessThanZeroMessage);
+                throw new ArgumentOutOfRangeException("", amount, DebitAmountLessThanZeroMessage);
             m_balance -= amount;
         }
killedBy: Bank.Domain.Tests.BankAccountTests.Debit_WhenAmountIsLessThanZero_ShouldThrowArgumentOutOfRange
